"""
utils.py

Модуль, содержащий различные методы и утилиты.

Группа: ЕТ-128
ФИО: Бабушкин Михаил Вадимович
"""

# Библиотеки
# Сторонние библиотеки
import numpy as np # библиотека функций для работы с матрицами


def sigmoid(z): # определение сигмоидальной функции активации
    return 1.0 / (1.0 + np.exp(-z))

def sigmoid_prime(z): # Производная сигмоидальной функции
    return sigmoid(z) * (1 - sigmoid(z))

def vectorized_result(j): # Преобразует числовую метку класса в вектор-столбец для обучения нейронной сети
    e = np.zeros((10, 1))
    e[j] = 1.0
    return e
